# Pandas DataFrame Özellikleri&Oluşturma

In [2]:
import numpy as np
import pandas as pd
l=[1,4,577,343]
l

[1, 4, 577, 343]

In [83]:
pd.DataFrame(l,columns=['degisken_ismi'])

   degisken_ismi
0              1
1              4
2            577
3            343

In [84]:
df=pd.DataFrame(l,columns=['degisken_ismi'])

In [85]:
type(df)

pandas.core.frame.DataFrame

In [86]:
df.axes

[RangeIndex(start=0, stop=4, step=1), Index(['degisken_ismi'], dtype='object')]

In [87]:
df.shape

(4, 1)

In [88]:
df.ndim

2

In [89]:
df.size

4

In [90]:
df.values

array([[  1],
       [  4],
       [577],
       [343]], dtype=int64)

In [91]:
df.head(2)

   degisken_ismi
0              1
1              4

In [92]:
df.tail(2)

   degisken_ismi
2            577
3            343

In [93]:
a= np.array([1,2,3,4,56])

In [94]:
pd.DataFrame(a,columns=['degisken_ismi'])

   degisken_ismi
0              1
1              2
2              3
3              4
4             56

In [95]:
m=np.arange(1,10).reshape(3,3)
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [96]:
a=np.random.randint(0,10,12).reshape(4,3)
a

array([[3, 6, 7],
       [6, 6, 8],
       [7, 9, 2],
       [8, 8, 6]])

In [97]:
lig=pd.DataFrame(a,columns=['beraberlik','maglubiyet','galibiyet'],index=['gs','fb','bjk','ts'])
lig

     beraberlik  maglubiyet  galibiyet
gs            3           6          7
fb            6           6          8
bjk           7           9          2
ts            8           8          6

In [98]:
df= pd.DataFrame(m,columns=['var1','var2','var3'])
df

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [99]:
df.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [100]:
df.columns=['deg1','deg2','deg3']
df

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [101]:
pd.DataFrame(m,columns=['var1','var2','var3'],index=['a','b','c'])

   var1  var2  var3
a     1     2     3
b     4     5     6
c     7     8     9

In [102]:
pd.Series([1,2,3,4])

0    1
1    2
2    3
3    4
dtype: int64

In [103]:
pd.DataFrame(pd.Series([1,2,3,4]),columns=['degisken'])

   degisken
0         1
1         2
2         3
3         4

In [104]:
bir=pd.Series([1,2,3,4])
iki=pd.Series([1,2,3,4])

In [105]:
pd.DataFrame({'degisken1':bir,
             'degisken2':iki})

   degisken1  degisken2
0          1          1
1          2          2
2          3          3
3          4          4

In [106]:
sozluk={"reg": {"RMSE":10,
                "MSE": 11,
                "SSE":90},
       
        "loj": {"RMSE":89,
                "MSE":12,
                "SSE":45},
        
        "cart":{"RMSE":45,
                "MSE":22,
                "SSE":11}}

In [107]:
pd.DataFrame(sozluk)

      cart  loj  reg
MSE     22   12   11
RMSE    45   89   10
SSE     11   45   90

## Dataframe Eleman İşlemleri

In [123]:
s1=np.random.randint(10,size=5)
s2=np.random.randint(10,size=5)
s3=np.random.randint(10,size=5)

df=pd.DataFrame({'var1':s1,'var2':s2,'var3':s3})
df

   var1  var2  var3
0     6     5     7
1     2     2     8
2     3     0     4
3     8     4     7
4     8     2     7

In [124]:
df[0:1]

   var1  var2  var3
0     6     5     7

In [125]:
df.index=['a','b','c','d','e']

In [126]:
df

   var1  var2  var3
a     6     5     7
b     2     2     8
c     3     0     4
d     8     4     7
e     8     2     7

In [127]:
df['c':'e']

   var1  var2  var3
c     3     0     4
d     8     4     7
e     8     2     7

In [128]:
df.drop('a',axis=0)

   var1  var2  var3
b     2     2     8
c     3     0     4
d     8     4     7
e     8     2     7

In [129]:
df

   var1  var2  var3
a     6     5     7
b     2     2     8
c     3     0     4
d     8     4     7
e     8     2     7

In [130]:
df.drop('a',axis=0,inplace=True)

In [131]:
df

   var1  var2  var3
b     2     2     8
c     3     0     4
d     8     4     7
e     8     2     7

In [132]:
l=['b','c']
l

['b', 'c']

In [133]:
df.drop(l,axis=0)

   var1  var2  var3
d     8     4     7
e     8     2     7

In [141]:
df

   var1  var2  var3
b     2     2     8
c     3     0     4
d     8     4     7
e     8     2     7

In [135]:
'var1' in df

True

In [142]:
'b' in df

False

In [144]:
l= ['var1','var2','var4']

In [145]:
for i in l:
    print(i in df)

True
True
False

In [146]:
df['var1'] is df['var2']

False

In [147]:
df['var1'] is df['var1']

True

In [148]:
df['var2']

b    2
c    0
d    4
e    2
Name: var2, dtype: int32

In [149]:
df.var1

b    2
c    3
d    8
e    8
Name: var1, dtype: int32

In [150]:
df[['var1','var2']]

   var1  var2
b     2     2
c     3     0
d     8     4
e     8     2

In [152]:
l=['var1','var2']
df[l]

   var1  var2
b     2     2
c     3     0
d     8     4
e     8     2

In [153]:
df

   var1  var2  var3
b     2     2     8
c     3     0     4
d     8     4     7
e     8     2     7

In [154]:
df['var4'] = df['var1']/df['var2']

In [155]:
df

   var1  var2  var3      var4
b     2     2     8  1.000000
c     3     0     4       inf
d     8     4     7  2.000000
e     8     2     7  4.000000

In [156]:
df.drop('var4',axis=1,inplace=True)

In [157]:
df

   var1  var2  var3
b     2     2     8
c     3     0     4
d     8     4     7
e     8     2     7

In [158]:
df.drop(l,axis=1)

   var3
b     8
c     4
d     7
e     7

## Gözlem ve Değişkenlere Birlikte Erişmek

In [159]:
s1=np.random.randint(10,size=5)
s2=np.random.randint(10,size=5)
s3=np.random.randint(10,size=5)
df=pd.DataFrame({'var1':s1,'var2':s2,'var3':s3})
df

   var1  var2  var3
0     8     6     4
1     3     5     2
2     5     5     0
3     7     8     5
4     6     3     8

In [160]:
df.loc[0:3]

   var1  var2  var3
0     8     6     4
1     3     5     2
2     5     5     0
3     7     8     5

In [161]:
df.iloc[0:3]

   var1  var2  var3
0     8     6     4
1     3     5     2
2     5     5     0

In [162]:
df.iloc[0,0]

8

In [163]:
df.iloc[:3,:2]

   var1  var2
0     8     6
1     3     5
2     5     5

In [164]:
df.iloc[2:6,1:3]

   var2  var3
2     5     0
3     8     5
4     3     8

In [165]:
df.loc[0:3,'var3']

0    4
1    2
2    0
3    5
Name: var3, dtype: int32

In [166]:
df.loc[0:3,'var2':'var3']

   var2  var3
0     6     4
1     5     2
2     5     0
3     8     5

In [168]:
try:
    df[0:3,'var2':'var3']
except:
    print('Hata')

Hata

In [169]:
try:
    df.iloc[0:3,'var2':'var3']
except:
    print('Hata')

Hata

In [170]:
df.iloc[0:3,1:3]

   var2  var3
0     6     4
1     5     2
2     5     0

In [171]:
df

   var1  var2  var3
0     8     6     4
1     3     5     2
2     5     5     0
3     7     8     5
4     6     3     8

In [172]:
df.index=['a','b','c','d','e']
df

   var1  var2  var3
a     8     6     4
b     3     5     2
c     5     5     0
d     7     8     5
e     6     3     8

In [176]:
try:
    df.iloc['c':'d','var2':'var3']
except:
    print('hata')

hata

In [177]:
df.loc['c':'d','var2':'var3']

   var2  var3
c     5     0
d     8     5

In [179]:
df[df.var1>5]

   var1  var2  var3
a     8     6     4
d     7     8     5
e     6     3     8

In [180]:
df[df.var1>5]['var2']

a    6
d    8
e    3
Name: var2, dtype: int32

In [181]:
df[(df.var1>5) & (df.var3<7)]

   var1  var2  var3
a     8     6     4
d     7     8     5

In [182]:
try:
    df[df.var1>5]['var2','var1']
except:
    print('hata')

hata

In [183]:
df.loc[df.var1>5, ['var2','var1']]

   var2  var1
a     6     8
d     8     7
e     3     6

In [184]:
try:
    df[df.var1>5, ['var2','var1']]
except:
    print('hata')

hata

## Birleştirme(join) İşlemleri

In [5]:
s1=np.random.randint(10,size=5)
s2=np.random.randint(10,size=5)
s3=np.random.randint(10,size=5)

df1=pd.DataFrame({'var1':s1,'var2':s2,'var3':s3})
df1

   var1  var2  var3
0     8     2     5
1     0     9     1
2     3     8     2
3     0     8     5
4     2     1     1

In [6]:
df2=df1+99
df2

   var1  var2  var3
0   107   101   104
1    99   108   100
2   102   107   101
3    99   107   104
4   101   100   100

In [7]:
pd.concat([df1,df2],axis=1)

   var1  var2  var3  var1  var2  var3
0     8     2     5   107   101   104
1     0     9     1    99   108   100
2     3     8     2   102   107   101
3     0     8     5    99   107   104
4     2     1     1   101   100   100

In [8]:
import pandas as pd
pd.concat([df1,df2])

   var1  var2  var3
0     8     2     5
1     0     9     1
2     3     8     2
3     0     8     5
4     2     1     1
0   107   101   104
1    99   108   100
2   102   107   101
3    99   107   104
4   101   100   100

In [9]:
pd.concat([df1,df2],ignore_index=True)

   var1  var2  var3
0     8     2     5
1     0     9     1
2     3     8     2
3     0     8     5
4     2     1     1
5   107   101   104
6    99   108   100
7   102   107   101
8    99   107   104
9   101   100   100

In [10]:
df2.columns=['var1','var2','deg3']
df2

   var1  var2  deg3
0   107   101   104
1    99   108   100
2   102   107   101
3    99   107   104
4   101   100   100

In [11]:
df1

   var1  var2  var3
0     8     2     5
1     0     9     1
2     3     8     2
3     0     8     5
4     2     1     1

In [12]:
pd.concat([df1,df2])

    deg3  var1  var2  var3
0    NaN     8     2   5.0
1    NaN     0     9   1.0
2    NaN     3     8   2.0
3    NaN     0     8   5.0
4    NaN     2     1   1.0
0  104.0   107   101   NaN
1  100.0    99   108   NaN
2  101.0   102   107   NaN
3  104.0    99   107   NaN
4  100.0   101   100   NaN

In [13]:
pd.concat([df1,df2],join='inner')

   var1  var2
0     8     2
1     0     9
2     3     8
3     0     8
4     2     1
0   107   101
1    99   108
2   102   107
3    99   107
4   101   100

In [14]:
pd.concat([df1,df2],join_axes=[df1.columns])

   var1  var2  var3
0     8     2   5.0
1     0     9   1.0
2     3     8   2.0
3     0     8   5.0
4     2     1   1.0
0   107   101   NaN
1    99   108   NaN
2   102   107   NaN
3    99   107   NaN
4   101   100   NaN

#### merge ve join işlemleri

In [15]:
df1=pd.DataFrame({'calisanlar':['Ali','Veli','Ayse','Fatma'],
                 'grup':['Muhasebe','Muhendislik','Muhendislik','İK']})
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           İK

In [16]:
df2=pd.DataFrame({'calisanlar':['Ayse','Ali','Veli','Fatma'],
                 'ilk_giris':[2010,2009,2014,2019]})
df2

  calisanlar  ilk_giris
0       Ayse       2010
1        Ali       2009
2       Veli       2014
3      Fatma       2019

In [17]:
df4=pd.DataFrame({'grup':['Muhasebe','Muhendislik','İK'],
                 'mudur':['Caner','Mustafa','Berkcan']})
df4

          grup    mudur
0     Muhasebe    Caner
1  Muhendislik  Mustafa
2           İK  Berkcan

In [18]:
df5=pd.DataFrame({'grup':['Muhasebe','Muhasebe',
                         'Muhendislik','Muhendislik','İK','İK'],
                 'yetenekler':['matematik','excel','kodlama','linux',
                              'excel','yonetim']})
df5

          grup yetenekler
0     Muhasebe  matematik
1     Muhasebe      excel
2  Muhendislik    kodlama
3  Muhendislik      linux
4           İK      excel
5           İK    yonetim

In [21]:
pd.merge(df1,df2)

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           İK       2019

In [22]:
pd.merge(df1,df2,on='calisanlar')

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           İK       2019

##### many to-one birleştirmesi

In [24]:
df3=pd.merge(df1,df2)
df3

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           İK       2019

In [25]:
df4=pd.DataFrame({'grup':['Muhasebe','Muhendislik','İK'],
                 'mudur':['Caner','Mustafa','Berkcan']})
df4

          grup    mudur
0     Muhasebe    Caner
1  Muhendislik  Mustafa
2           İK  Berkcan

In [26]:
pd.merge(df3,df4)

  calisanlar         grup  ilk_giris    mudur
0        Ali     Muhasebe       2009    Caner
1       Veli  Muhendislik       2014  Mustafa
2       Ayse  Muhendislik       2010  Mustafa
3      Fatma           İK       2019  Berkcan

##### many-to-many birleştirmesi

In [28]:
df5

          grup yetenekler
0     Muhasebe  matematik
1     Muhasebe      excel
2  Muhendislik    kodlama
3  Muhendislik      linux
4           İK      excel
5           İK    yonetim

In [29]:
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           İK

In [31]:
pd.merge(df1,df5)

  calisanlar         grup yetenekler
0        Ali     Muhasebe  matematik
1        Ali     Muhasebe      excel
2       Veli  Muhendislik    kodlama
3       Veli  Muhendislik      linux
4       Ayse  Muhendislik    kodlama
5       Ayse  Muhendislik      linux
6      Fatma           İK      excel
7      Fatma           İK    yonetim

In [33]:
df3=pd.DataFrame({'name':['Ali','Veli','Ayse','Fatma'],
                 'maas':[7000,8000,120000,90000]})
df3

     maas   name
0    7000    Ali
1    8000   Veli
2  120000   Ayse
3   90000  Fatma

In [34]:
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           İK

In [35]:
try:
    pd.merge(df1,df3)
except:
    print('hata')

hata

In [36]:
pd.merge(df1,df3,left_on='calisanlar',right_on='name')

  calisanlar         grup    maas   name
0        Ali     Muhasebe    7000    Ali
1       Veli  Muhendislik    8000   Veli
2       Ayse  Muhendislik  120000   Ayse
3      Fatma           İK   90000  Fatma

In [39]:
pd.merge(df1,df3,left_on='calisanlar',right_on='name').drop('name',axis=1)

  calisanlar         grup    maas
0        Ali     Muhasebe    7000
1       Veli  Muhendislik    8000
2       Ayse  Muhendislik  120000
3      Fatma           İK   90000

In [41]:
df1a=df1.set_index('calisanlar')

In [42]:
df1a

                   grup
calisanlar
Ali            Muhasebe
Veli        Muhendislik
Ayse        Muhendislik
Fatma                İK

In [43]:
df1a.shape

(4, 1)

In [45]:
df1.shape

(4, 2)

In [49]:
df2

  calisanlar  ilk_giris
0       Ayse       2010
1        Ali       2009
2       Veli       2014
3      Fatma       2019

In [51]:
df2a=df2.set_index('calisanlar')
df2a

            ilk_giris
calisanlar
Ayse             2010
Ali              2009
Veli             2014
Fatma            2019

In [52]:
pd.merge(df1a,df2a,left_index=True,right_index=True)

                   grup  ilk_giris
calisanlar
Ali            Muhasebe       2009
Veli        Muhendislik       2014
Ayse        Muhendislik       2010
Fatma                İK       2019

In [53]:
df1a.join(df2a)

                   grup  ilk_giris
calisanlar
Ali            Muhasebe       2009
Veli        Muhendislik       2014
Ayse        Muhendislik       2010
Fatma                İK       2019

In [55]:
dfa=pd.DataFrame({'calisanlar':['Ali','Veli','Ayse','Fatma'],
                 'siralama':[1,2,3,4]})
dfa

  calisanlar  siralama
0        Ali         1
1       Veli         2
2       Ayse         3
3      Fatma         4

In [57]:
dfb=pd.DataFrame({'calisanlar':['Ali','Veli','Ayse','Fatma'],
                 'siralama':[3,1,4,2]})
dfb

  calisanlar  siralama
0        Ali         3
1       Veli         1
2       Ayse         4
3      Fatma         2

In [58]:
pd.merge(dfa,dfb,on='calisanlar')

  calisanlar  siralama_x  siralama_y
0        Ali           1           3
1       Veli           2           1
2       Ayse           3           4
3      Fatma           4           2

In [59]:
pd.merge(dfa,dfb,on='calisanlar',suffixes=['_MAAS','_DENEYIM'])

  calisanlar  siralama_MAAS  siralama_DENEYIM
0        Ali              1                 3
1       Veli              2                 1
2       Ayse              3                 4
3      Fatma              4                 2

## Aggregation ve Gruplama İşlemleri

In [85]:
import seaborn as sns

In [87]:
df=sns.load_dataset('planets')
df

               method  number  orbital_period    mass  distance  year
0     Radial Velocity       1      269.300000   7.100     77.40  2006
1     Radial Velocity       1      874.774000   2.210     56.95  2008
2     Radial Velocity       1      763.000000   2.600     19.84  2011
3     Radial Velocity       1      326.030000  19.400    110.62  2007
4     Radial Velocity       1      516.220000  10.500    119.47  2009
5     Radial Velocity       1      185.840000   4.800     76.39  2008
6     Radial Velocity       1     1773.400000   4.640     18.15  2002
7     Radial Velocity       1      798.500000     NaN     21.41  1996
8     Radial Velocity       1      993.300000  10.300     73.10  2008
9     Radial Velocity       2      452.800000   1.990     74.79  2010
10    Radial Velocity       2      883.000000   0.860     74.79  2010
11    Radial Velocity       1      335.100000   9.880     39.43  2009
12    Radial Velocity       1      479.100000   3.880     97.28  2008
13    Radial Velocity       3     1078.000000   2.530     14.08  1996
14    Radial Velocity       3     2391.000000   0.540     14.08  2001
15    Radial Velocity       3    14002.000000   1.640     14.08  2009
16    Radial Velocity       1        4.230785   0.472     15.36  1995
17    Radial Velocity       5       14.651000   0.800     12.53  1996
18    Radial Velocity       5       44.380000   0.165     12.53  2004
19    Radial Velocity       5     4909.000000   3.530     12.53  2002
20    Radial Velocity       5        0.736540     NaN     12.53  2011
21    Radial Velocity       5      261.200000   0.172     12.53  2007
22    Radial Velocity       3        4.215000   0.016      8.52  2009
23    Radial Velocity       3       38.021000   0.057      8.52  2009
24    Radial Velocity       3      123.010000   0.072      8.52  2009
25    Radial Velocity       1      116.688400     NaN     18.11  1996
26    Radial Velocity       1      691.900000     NaN     81.50  2012
27    Radial Velocity       1      952.700000   5.300     97.18  2008
28    Radial Velocity       1      181.400000   3.200     45.52  2013
29            Imaging       1             NaN     NaN     45.52  2005
...               ...     ...             ...     ...       ...   ...
1005          Transit       1        3.693641     NaN    200.00  2012
1006          Transit       1        4.465633     NaN    330.00  2012
1007          Transit       1        4.617101     NaN    255.00  2012
1008          Transit       1        2.838971     NaN    455.00  2012
1009          Transit       1        5.017180     NaN    300.00  2012
1010          Transit       1        7.919585     NaN    125.00  2012
1011          Transit       1        4.305001     NaN    400.00  2012
1012          Transit       1        3.855900     NaN    480.00  2012
1013          Transit       1        4.411953     NaN    160.00  2012
1014          Transit       1        4.378090     NaN    330.00  2012
1015          Transit       1        1.573292     NaN    350.00  2012
1016          Transit       1        2.311424     NaN    310.00  2013
1017          Transit       1        4.086052     NaN    380.00  2012
1018          Transit       1        4.614420     NaN    225.00  2012
1019          Transit       1        2.903675     NaN    345.00  2012
1020          Transit       1        2.216742     NaN    340.00  2012
1021          Transit       1        2.484193     NaN    260.00  2013
1022          Transit       1        1.360031     NaN     93.00  2012
1023          Transit       1        2.175176     NaN    550.00  2012
1024          Transit       1        3.662387     NaN    240.00  2012
1025          Transit       1        3.067850     NaN     60.00  2012
1026          Transit       1        0.925542     NaN    470.00  2014
1027          Imaging       1             NaN     NaN     19.20  2011
1028          Transit       1        3.352057     NaN   3200.00  2012
1029          Imaging       1             NaN     NaN     10.10  2012
1030          Transit       1        3.941507     NaN    172.00  2006
1031          Transit       1        2.615864     NaN    148.00  2007
1032          Transit       1        3.191524     NaN    174.00  2007
1033          Transit       1        4.125083     NaN    293.00  2008
1034          Transit       1        4.187757     NaN    260.00  2008

[1035 rows x 6 columns]

In [88]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [89]:
df.shape

(1035, 6)

In [90]:
df.count()

method            1035
number            1035
orbital_period     992
mass               513
distance           808
year              1035
dtype: int64

In [91]:
df['mass']

0        7.100
1        2.210
2        2.600
3       19.400
4       10.500
5        4.800
6        4.640
7          NaN
8       10.300
9        1.990
10       0.860
11       9.880
12       3.880
13       2.530
14       0.540
15       1.640
16       0.472
17       0.800
18       0.165
19       3.530
20         NaN
21       0.172
22       0.016
23       0.057
24       0.072
25         NaN
26         NaN
27       5.300
28       3.200
29         NaN
         ...
1005       NaN
1006       NaN
1007       NaN
1008       NaN
1009       NaN
1010       NaN
1011       NaN
1012       NaN
1013       NaN
1014       NaN
1015       NaN
1016       NaN
1017       NaN
1018       NaN
1019       NaN
1020       NaN
1021       NaN
1022       NaN
1023       NaN
1024       NaN
1025       NaN
1026       NaN
1027       NaN
1028       NaN
1029       NaN
1030       NaN
1031       NaN
1032       NaN
1033       NaN
1034       NaN
Name: mass, Length: 1035, dtype: float64

In [92]:
df['mass'].count()

513

In [93]:
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [94]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

#### kullanılabilir basit fonksiyonlar

count()
first()
last()
mean()
median()
min()
max()
std()
var()

In [95]:
df['mass'].describe()

count    513.000000
mean       2.638161
std        3.818617
min        0.003600
25%        0.229000
50%        1.260000
75%        3.040000
max       25.000000
Name: mass, dtype: float64

In [96]:
df.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [97]:
df.dropna().describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

In [98]:
df.dropna().describe().T

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

## Gruplama İşlemleri

In [99]:
df= pd.DataFrame({'gruplar':['A','B','C','A','B','C'],
                 'veri':[10,11,52,23,43,55]},columns=['gruplar','veri'])
df

  gruplar  veri
0       A    10
1       B    11
2       C    52
3       A    23
4       B    43
5       C    55

In [100]:
df.groupby('gruplar')

In [101]:
df.groupby('gruplar').sum()

         veri
gruplar
A          33
B          54
C         107

In [102]:
df=sns.load_dataset('planets')

In [103]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [104]:
df.groupby('method')

In [105]:
df.groupby('method')['orbital_period']

In [106]:
df.groupby('method')['orbital_period'].median()

method
Astrometry                         631.180000
Eclipse Timing Variations         4343.500000
Imaging                          27500.000000
Microlensing                      3300.000000
Orbital Brightness Modulation        0.342887
Pulsar Timing                       66.541900
Pulsation Timing Variations       1170.000000
Radial Velocity                    360.200000
Transit                              5.714932
Transit Timing Variations           57.011000
Name: orbital_period, dtype: float64

In [107]:
df.groupby('method')['orbital_period'].sum()

method
Astrometry                       1.262360e+03
Eclipse Timing Variations        4.276480e+04
Imaging                          1.418973e+06
Microlensing                     2.207500e+04
Orbital Brightness Modulation    2.127920e+00
Pulsar Timing                    3.671511e+04
Pulsation Timing Variations      1.170000e+03
Radial Velocity                  4.553151e+05
Transit                          8.377523e+03
Transit Timing Variations        2.393505e+02
Name: orbital_period, dtype: float64

In [108]:
df.groupby('method')['orbital_period'].mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [109]:
df.groupby('method')['orbital_period'].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,631.180000,544.217663,246.360000,438.770000,631.180000,823.590000,1016.000000
Eclipse Timing Variations,9.0,4751.644444,2499.130945,1916.250000,2900.000000,4343.500000,5767.000000,10220.000000
Imaging,12.0,118247.737500,213978.177277,4639.150000,8343.900000,27500.000000,94250.000000,730000.000000
Microlensing,7.0,3153.571429,1113.166333,1825.000000,2375.000000,3300.000000,3550.000000,5100.000000
Orbital Brightness Modulation,3.0,0.709307,0.725493,0.240104,0.291496,0.342887,0.943908,1.544929
Pulsar Timing,5.0,7343.021201,16313.265573,0.090706,25.262000,66.541900,98.211400,36525.000000
Pulsation Timing Variations,1.0,1170.000000,NaN,1170.000000,1170.000000,1170.000000,1170.000000,1170.000000
Radial Velocity,553.0,823.354680,1454.926210,0.736540,38.021000,360.200000,982.000000,17337.500000
Transit,397.0,21.102073,46.185893,0.355000,3.160630,5.714932,16.145700,331.600590
Transit Timing Variations,3.0,79.783500,71.599884,22.339500,39.675250,57.011000,108.505500,160.000000

## Aggregate, filter, transform, apply

In [110]:
df=pd.DataFrame({'gruplar':['A','B','C','A','B','C'],
                'degisken1':[10,23,33,22,11,99],
                'degisken2':[100,253,333,262,111,969]},
               columns=['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [111]:
df.groupby('gruplar').aggregate(['min',np.median,max])

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10     16  22       100    181  262
B              11     17  23       111    182  253
C              33     66  99       333    651  969

In [112]:
df.groupby('gruplar').aggregate({'degisken1':'min','degisken2':'max'})

         degisken1  degisken2
gruplar
A               10        262
B               11        253
C               33        969

In [122]:
def filter_func(x):
    return x['degisken1'].std()>9

In [123]:
df.groupby('gruplar').filter(filter_func)

  gruplar  degisken1  degisken2
2       C         33        333
5       C         99        969

In [126]:
df.groupby('gruplar').transform(lambda x: (x-x.mean())  / x.std())

   degisken1  degisken2
0  -0.707107  -0.707107
1   0.707107   0.707107
2  -0.707107  -0.707107
3   0.707107   0.707107
4  -0.707107  -0.707107
5   0.707107   0.707107

In [127]:
df.groupby('gruplar').apply(np.sum)

        gruplar  degisken1  degisken2
gruplar
A            AA         32        362
B            BB         34        364
C            CC        132       1302

In [128]:
df.groupby('gruplar').apply(np.mean)

         degisken1  degisken2
gruplar
A             16.0      181.0
B             17.0      182.0
C             66.0      651.0

In [129]:
df.groupby(df['gruplar']).sum()

         degisken1  degisken2
gruplar
A               32        362
B               34        364
C              132       1302

In [133]:
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [130]:
L=[0,1,0,1,2,0]

In [131]:
df.groupby(L).sum()

   degisken1  degisken2
0        142       1402
1         45        515
2         11        111

In [132]:
df.groupby(df['gruplar']).sum()

         degisken1  degisken2
gruplar
A               32        362
B               34        364
C              132       1302

## Pivot Tablolar

In [136]:
import pandas as pd 
import seaborn as sns
df=sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [137]:
df.groupby('sex')[['survived']].mean()

        survived
sex
female  0.742038
male    0.188908

In [138]:
df.groupby(['sex','class'])['survived'].aggregate('mean')

sex     class
female  First     0.968085
        Second    0.921053
        Third     0.500000
male    First     0.368852
        Second    0.157407
        Third     0.135447
Name: survived, dtype: float64

In [139]:
df.groupby(['sex','class'])['survived'].aggregate('mean').unstack()

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [140]:
df.pivot_table('survived',index='sex',columns='class')

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [142]:
age=pd.cut(df['age'],[0,18,90])
age.head()

0    (18, 90]
1    (18, 90]
2    (18, 90]
3    (18, 90]
4    (18, 90]
Name: age, dtype: category
Categories (2, interval[int64]): [(0, 18] < (18, 90]]

In [144]:
df.pivot_table('survived',['sex',age],'class')

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663

In [146]:
fare=pd.qcut(df['fare'],2)
fare.head()

0     (-0.001, 14.454]
1    (14.454, 512.329]
2     (-0.001, 14.454]
3    (14.454, 512.329]
4     (-0.001, 14.454]
Name: fare, dtype: category
Categories (2, interval[float64]): [(-0.001, 14.454] < (14.454, 512.329]]

In [147]:
df.pivot_table('survived',['sex',age],[fare,'class'])

fare            (-0.001, 14.454]                     (14.454, 512.329]  \
class                      First    Second     Third             First
sex    age
female (0, 18]               NaN  1.000000  0.714286          0.909091
       (18, 90]              NaN  0.880000  0.444444          0.972973
male   (0, 18]               NaN  0.000000  0.260870          0.800000
       (18, 90]              0.0  0.098039  0.125000          0.391304

fare
class              Second     Third
sex    age
female (0, 18]   1.000000  0.318182
       (18, 90]  0.914286  0.391304
male   (0, 18]   0.818182  0.178571
       (18, 90]  0.030303  0.192308

In [148]:
df.pivot_table(index='sex',columns='class',
              aggfunc={'survived':sum,'fare':'mean'})

              fare                       survived
class        First     Second      Third    First Second Third
sex
female  106.125798  21.970121  16.118810       91     70    72
male     67.226127  19.741782  12.661633       45     17    47

In [149]:
df.pivot_table('survived',index='sex',columns='class',margins=True)

class      First    Second     Third       All
sex
female  0.968085  0.921053  0.500000  0.742038
male    0.368852  0.157407  0.135447  0.188908
All     0.629630  0.472826  0.242363  0.383838

## Dış Kaynaklı Verileri Okuma

In [150]:
pwd

'C:\\Users\\Noname\\Desktop\\veri_bilimi_kursu_dök'

In [151]:
import pandas as pd

In [152]:
pd.read_csv('reading_data/ornekcsv.csv')

FileNotFoundError: File b'reading_data/ornekcsv.csv' does not exist